app/controllers/badges_controller.rb

SELECT "badges".* FROM "badges"
---
  def index
    @badges = Badge.all

SELECT  "badges".* FROM "badges"  WHERE "badges"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @badge = Badge.find(params[:id])

INSERT INTO "badges" ("created_at", "description", "name", "picture", "score", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @badge = Badge.new(badge_params)
    @badge.save