app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("created_at", "description", "name", "score", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-11-21 13:48:57.262860"], ["description", "desc"], ["name", "abcd"], ["score", 10], ["updated_at", "2014-11-21 13:48:57.262860"]]