app/controllers/checkins_controller.rb

  def index
    @checkins = Checkin.all
---
SELECT "checkins".* FROM "checkins"

  def show_by_user_id
    @checkins = Checkin.find_by_user_id(params[:user_id])
---
SELECT  "checkins".* FROM "checkins"  WHERE "checkins"."user_id" = 1 LIMIT 1

  def show_by_recipe_id
    @checkins = Checkin.find_by_recipe_id(params[:recipe_id])
---
SELECT  "checkins".* FROM "checkins"  WHERE "checkins"."recipe_id" = 1 LIMIT 1

  def show
    @checkin = Checkin.find(params[:id])
---
SELECT  "checkins".* FROM "checkins"  WHERE "checkins"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @checkin = Checkin.find(params[:id])
---
SELECT  "checkins".* FROM "checkins"  WHERE "checkins"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @checkin = Checkin.new(checkin_params)
    @checkin.save
---
INSERT INTO "checkins" ("created_at", "date_time", "description", "picture", "recipe_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @checkin.update(checkin_params)
---
UPDATE "checkins" SET "picture" = ?, "updated_at" = ? WHERE "checkins"."id" = 1  [["picture", "IMAG2433.jpg"], ["updated_at", "2014-11-24 11:09:58.732195"]]

    def set_checkin
      @checkin = Checkin.find(params[:id])
---
SELECT  "checkins".* FROM "checkins"  WHERE "checkins"."id" = ? LIMIT 1  [["id", 1]]