app/controllers/has_badges_controller.rb

  def index
    @has_badges = HasBadge.all
---
SELECT "has_badges".* FROM "has_badges"

  def show_by_user_id
    @has_badges = HasBadge.find_by_user_id(params[:user_id])
---
SELECT  "has_badges".* FROM "has_badges"  WHERE "has_badges"."user_id" = 1 LIMIT 1

  def show
    @has_badge = HasBadge.find(params[:id])
---
SELECT  "has_badges".* FROM "has_badges"  WHERE "has_badges"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @has_badge = HasBadge.new(has_badge_params)
    @has_badge.save
---
INSERT INTO "has_badges" ("badge_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["badge_id", 1], ["created_at", "2014-11-22 22:24:50.497075"], ["updated_at", "2014-11-22 22:24:50.497075"], ["user_id", 1]]