app/controllers/recipes_controller.rb

SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."category_id" = 1 LIMIT 1
---
  def show_by_category_id
    @recipes = Recipe.find_by_category_id(params[:category_id])

INSERT INTO "recipes" ("category_id", "created_at", "description", "message", "name", "score", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["category_id", 1], ["created_at", "2014-11-21 13:50:06.446439"], ["description", "dws"], ["message", "mfkm"], ["name", "ekdfo"], ["score", 200], ["updated_at", "2014-11-21 13:50:06.446439"]]
---
  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.save