app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @same_fb_id = User.find_by_fb_id(@user.fb_id)
    if @same_fb_id == nil
      @user.save
---
SELECT  "users".* FROM "users"  WHERE "users"."fb_id" = '12345' LIMIT 1
INSERT INTO "users" ("created_at", "fb_id", "first_name", "last_name", "score", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-11-20 14:10:35.700511"], ["fb_id", "12345"], ["first_name", "a"], ["last_name", "b"], ["score", 0], ["updated_at", "2014-11-20 14:10:35.700511"]]